In [1]:
%load_ext sql

In [2]:
%sql sqlite://

In [3]:
%%sql

CREATE TABLE Worker (ID INT PRIMARY KEY  ,
                     First_Name VARCHAR (20) NOT NULL , 
                     Last_Name VARCHAR(20) , 
                     EMAIL varchar(50) ,
                     DEPARTMENT VARCHAR(20) NOT NULL , 
                     Salary INT , 
                     Join_Date DATE) ;

 * sqlite://
Done.

[]

In [4]:
%%sql

INSERT INTO Worker Values(1,'Vishal','Rathore','vishalrathore@ineuron.com','Finance', 45000,'2018-02-12');
INSERT INTO Worker Values(2,'Rahul','Sarathe','rahulsarathe@ineuron.com','HR', 60000,  '2017-04-17');
INSERT INTO Worker Values(3,'Anisha','Gour','anishagour@ineuron.com','Purchase', 30000, '2017-12-20');
INSERT INTO Worker Values(4,'Saksham','Mahajan','sakshammahajan@ineuron.com','Finance', 60000, '2019-11-12');
INSERT INTO Worker Values(5,'Aakash','Singh','amansingh@ineuron.com','Purchase',30000,  '2017-09-05');
INSERT INTO Worker Values(6,'Ankit','Kumar','ankitkumar@ineuron.com','Marketing', 50000,  '2020-01-14');
INSERT INTO Worker Values(7,'Riya','Agarwal','riyaagarwal@ineuron.com','Finance', 45000, '2018-04-23');
INSERT INTO Worker Values(8,'Nishit','Sharma','nishitsharma@ineuron.com','Purchase', 48000, '2018-10-10');
INSERT INTO Worker Values(9,'Samay','Raina','samayraina@ineuron.com','Marketing', 36000,  '2017-08-22');
INSERT INTO Worker Values(10,'Aman','Singh','amansingh@ineuron.com','Finance', 45000,  '2017-08-12');
INSERT INTO Worker Values(11,'Sarthak','Jain','sarthakjain@ineuron.com','Purchase', 48000,  '2018-04-08');
INSERT INTO Worker Values(12,'Ashutosh','Patil','ashutoshpatil@ineuron.com','PR', 50000,  '2019-09-26');
INSERT INTO Worker Values(13,'Harshit','Kumar','harshitkumar@ineuron.com','HR', 40000,  '2018-06-05');
INSERT INTO Worker Values(14,'Ayush','Srivastav','ayushsrivastav@ineuron.com','Purchase', 30000,  '2018-08-24');
INSERT INTO Worker Values(15,'Shreyansh','Deriya','shreyanshderiya@ineuron.com','PR', 35000, '2017-07-13');
INSERT INTO Worker Values(16,'Aryan','Sharma','aryansharma@ineuron.com','Finance', 60000,  '2019-10-31');
INSERT INTO Worker Values(17,'Snehal','Reddy','snehalreddy@ineuron.com','HR', 40000, '2019-03-28');
INSERT INTO Worker Values(18,'Shubham','Mittal','shubhammittal@ineuron.com','PR', 35000,'2020-02-01');
INSERT INTO Worker Values(19,'Rakshit','Rao','rakshitao@ineuron.com','Marketing', 36000, '2018-11-30');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

##Q.1 Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [5]:
%%sql

SELECT RTRIM(First_name)
FROM Worker;

 * sqlite://
Done.

[('Vishal',),
 ('Rahul',),
 ('Anisha',),
 ('Saksham',),
 ('Aakash',),
 ('Ankit',),
 ('Riya',),
 ('Nishit',),
 ('Samay',),
 ('Aman',),
 ('Sarthak',),
 ('Ashutosh',),
 ('Harshit',),
 ('Ayush',),
 ('Shreyansh',),
 ('Aryan',),
 ('Snehal',),
 ('Shubham',),
 ('Rakshit',)]

##Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [7]:
%%sql

SELECT DISTINCT DEPARTMENT ,LENGTH(DEPARTMENT) AS LENGTH FROM Worker;

 * sqlite://
Done.

[('Finance', 7), ('HR', 2), ('Purchase', 8), ('Marketing', 9), ('PR', 2)]

##Q-3. Write an SQL query to fetch nth max salaries from a table.

In [8]:
%%sql

SELECT MAX(Salary) AS '6TH HIGHEST SALARY' FROM WORKER  WHERE Salary NOT IN
(SELECT DISTINCT  Salary FROM Worker ORDER BY Salary DESC LIMIT 5);

 * sqlite://
Done.

[(36000,)]